{ "translations": {
    "Nextcloud Assistant" : "Nextcloud-Assistent",
    "Task for \"%1$s\" has finished" : "Aufgabe für \"%1$s\" beendet",
    "\"%1$s\" task for \"%2$s\" has finished" : "\"%1$s\" Aufgabe für \"%2$s\" ist beendet",
    "Input: %1$s" : "Eingabe: %1$s",
    "View results" : "Ergebnisse anzeigen",
    "Task for \"%1$s\" has failed" : "Aufgabe für \"%1$s\" ist fehlgeschlagen",
    "\"%1$s\" task for \"%2$s\" has failed" : "\"%1$s\" Aufgabe für \"%2$s\" ist fehlgeschlagen",
    "View task" : "Aufgabe anzeigen",
    "Artificial Intelligence" : "Künstiche Intelligenz",
    "Process and transform text" : "Text verarbeiten und transformieren",
    "This app brings a user interface to use the Nextcloud text processing feature.\n\nIt allows users to launch text processing tasks, be notified when they finish and see the results.\nThe assistant also appears in others apps like Text to easily process parts of a document.\n\n### How to use it\n\nA new right header  menu entry appears. Once clicked, the assistant is displayed and you can select and task type and\nset the input text you want to process.\n\nOnce a task is scheduled, it will run as a background job. When it is finished, you will receive a notification\nfrom which the results can be displayed.\n\nOther apps can integrate with the assistant. For example, Text will display an inline button besides every paragraph\nto directly select a task type to process this paragraph. Selecting a task this way will open the assistant with the task\nbeing pre-selected and the input text set.\n\n### Text processing providers\n\nIn the assistant, the list of available tasks depends on the available providers installed via other apps.\nThis means you have complete freedom over which service/software will actually run your text processing tasks.\nSo far, the [Large language model](https://github.com/nextcloud/llm#readme)\nand the [OpenAi/LocalAI integration](https://apps.nextcloud.com/apps/integration_openai) apps\ninclude text processing providers to:\n* Summarize\n* Extract topics\n* Generate a headline\n* Get an answer from a free prompt\n* Reformulate (OpenAi/LocalAi only)" : "Diese App bietet eine Benutzeroberfläche zur Nutzung der Nextcloud-Textverarbeitungsfunktion.\n\nEs ermöglicht Benutzern, Textverarbeitungsaufgaben zu starten, benachrichtigt zu werden, wenn sie fertig sind, und die Ergebnisse anzuzeigen.\nDer Assistent erscheint auch in anderen Apps wie Text, um Teile eines Dokuments einfach zu verarbeiten.\n\n### Wie man es benutzt\n\nEin neuer Menüeintrag in der rechten Kopfzeile wird angezeigt. Sobald Sie darauf klicken, wird der Assistent angezeigt und Sie können einen Aufgabentyp auswählen und\nLegen Sie den Eingabetext fest, den Sie verarbeiten möchten.\n\nSobald eine Aufgabe geplant ist, wird sie als Hintergrundjob ausgeführt. Wenn es fertig ist, erhalten Sie eine Benachrichtigung\nvon dem aus die Ergebnisse angezeigt werden können.\n\nAndere Apps können in den Assistenten integriert werden. Beispielsweise zeigt Text neben jedem Absatz eine Inline-Schaltfläche an\num direkt einen Aufgabentyp zur Bearbeitung dieses Absatzes auszuwählen. Wenn Sie auf diese Weise eine Aufgabe auswählen, wird der Assistent mit der Aufgabe geöffnet\nvorausgewählt und der Eingabetext festgelegt.\n\n### Textverarbeitungsanbieter\n\nIm Assistenten hängt die Liste der verfügbaren Aufgaben von den verfügbaren Anbietern ab, die über andere Apps installiert wurden.\nDas bedeutet, dass Sie völlig frei entscheiden können, welcher Dienst bzw. welche Software Ihre Textverarbeitungsaufgaben tatsächlich ausführt.\nBisher ist das [große Sprachmodell](https://github.com/nextcloud/llm#readme)\nund die [OpenAi/LocalAI-Integration](https://apps.nextcloud.com/apps/integration_openai) Apps\nEinbinden von Textverarbeitungsanbietern, um:\n* Zusammenfassen\n* Themen extrahieren\n* Generieren Sie eine Überschrift\n* Erhalten Sie eine Antwort über eine kostenlose Eingabeaufforderung\n* Umformulieren (nur OpenAi/LocalAi)",
    "Select which features you want to enable" : "Wählen Sie, welche Funktionen aktiviert werden sollen",
    "Top-right assistant" : "Assistent oben rechts",
    "Assistant admin options saved" : "Assistenten-Adiminstrations-Einstellungen gespeichert",
    "Failed to save assistant admin options" : "Fehler beim Speichern der Assistenten-Adiminstrations-Einstellungen",
    "Choose a task" : "Eine Aufgabe auswählen",
    "Type some text" : "Geben Sie Text ein",
    "Result" : "Ergebnis",
    "Submit assistant task" : "Assistentenaufgabe senden",
    "Submit" : "Übermitteln",
    "Copy task output" : "Aufgabenausgabe kopieren",
    "Copy" : "Kopieren",
    "Try again" : "Nochmals versuchen",
    "Result could not be copied to clipboard" : "Ergebnis konnte nicht in die Zwischenablage kopiert werden",
    "Your task has been scheduled, you will receive a notification when it has finished" : "Ihre Aufgabe wurde geplant. Sie erhalten eine Benachrichtigung, wenn sie abgeschlossen ist",
    "Close" : "Schließen",
    "Close Nextcloud Assistant" : "Nextcloud-Assistent schließen",
    "Assistant options saved" : "Assistenteneinstellungen gespeichert",
    "Failed to save assistant options" : "Fehler beim Speichern der Assistenteneinstellungen",
    "Failed to schedule your task" : "Die Planung Ihrer Aufgabe ist fehlgeschlagen",
    "This task does not exist or has been cleaned up" : "Diese Aufgabe existiert nicht oder wurde bereinigt",
    "Failed to schedule the task" : "Die Planung der Aufgabe ist fehlgeschlagen"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}