{ "translations": {
    "Nextcloud Assistant" : "Asistente de Nextcloud",
    "Task for \"%1$s\" has finished" : "La tarea para \"%1$s\" ha finalizado",
    "\"%1$s\" task for \"%2$s\" has finished" : "La tarea \"%1$s\" para \"%2$s\" ha finalizado",
    "Input: %1$s" : "Entrada: %1$s",
    "View results" : "Ver resultados",
    "Task for \"%1$s\" has failed" : "La tarea para \"%1$s\" ha fallado",
    "\"%1$s\" task for \"%2$s\" has failed" : "La tarea \"%1$s\" para \"%2$s\" ha fallado",
    "View task" : "Ver tarea",
    "Artificial Intelligence" : "Inteligencia Artificial",
    "Process and transform text" : "Procesar y transformar texto",
    "This app brings a user interface to use the Nextcloud text processing feature.\n\nIt allows users to launch text processing tasks, be notified when they finish and see the results.\nThe assistant also appears in others apps like Text to easily process parts of a document.\n\n### How to use it\n\nA new right header  menu entry appears. Once clicked, the assistant is displayed and you can select and task type and\nset the input text you want to process.\n\nOnce a task is scheduled, it will run as a background job. When it is finished, you will receive a notification\nfrom which the results can be displayed.\n\nOther apps can integrate with the assistant. For example, Text will display an inline button besides every paragraph\nto directly select a task type to process this paragraph. Selecting a task this way will open the assistant with the task\nbeing pre-selected and the input text set.\n\n### Text processing providers\n\nIn the assistant, the list of available tasks depends on the available providers installed via other apps.\nThis means you have complete freedom over which service/software will actually run your text processing tasks.\nSo far, the [Large language model](https://github.com/nextcloud/llm#readme)\nand the [OpenAi/LocalAI integration](https://apps.nextcloud.com/apps/integration_openai) apps\ninclude text processing providers to:\n* Summarize\n* Extract topics\n* Generate a headline\n* Get an answer from a free prompt\n* Reformulate (OpenAi/LocalAi only)" : "Esta app brinda una interfaz de usuario para utilizar la característica de procesamiento de texto de Nextcloud.\n\nPermite a los usuarios lanzar tareas de procesamiento de texto, ser notificados cuando estas finalizan y ver los resultados.\nEl asistente también aparece en otras apps como Text para procesar fácilmente partes de un documento.\n\n### Cómo utilizarla\n\nUna entrada nueva en el menú en la cabecera derecha aparecerá. Una vez que haga clic, el asistente se mostrará y ud puede seleccionar el tipo de tarea y\nestablecer el texto de entrada que quiere procesar.\n\nUna vez que una tarea se agenda, se ejecutará como un trabajo en segundo plano. Cuando termine, recibirá una notificación\ndesde la cual los resultados pueden ser mostrados.\n\nOtras apps pueden integrarse con el asistente. Por ejemplo, Text mostrará un botón integrado junto a cada párrafo\npara seleccionar directamente un tipo de tarea para procesar este párrafo. Al seleccionar una tarea de esta manera abrirá el asistente con la tarea\nya preseleccionada y el texto de entrada establecido.\n\n### Proveedores de procesamiento de texto\n\nEn el asistente, la lista de tareas disponibles depende de los proveedores disponibles que han sido instalados a través de otras apps.\nEsto significa que tiene completa libertad sobre cual servicio/software será el que ejecute sus tareas de procesamiento de texto.\nHasta ahora las apps, [Modelo largo de lenguaje (LLM)](https://github.com/nextcloud/llm#readme)\ny la [Integración con OpenAi/LocalAI](https://apps.nextcloud.com/apps/integration_openai) \nincluyen proveedores de procesamiento de texto para:\n* Resumir\n* Extraer tópicos\n* Generar una cabecera/título\n* Obtener una respuesta de un prompt libre\n* Reformular (sólo OpenAi/LocalAi)",
    "Select which features you want to enable" : "Seleccione las características que desea habilitar",
    "Top-right assistant" : "Asistente superior derecho",
    "Assistant admin options saved" : "Opciones de administración del asistente guardadas",
    "Failed to save assistant admin options" : "Fallo al guardar las opciones de administración del asistente",
    "Choose a task" : "Seleccione una tarea",
    "Type some text" : "Escriba algo de texto",
    "Result" : "Resultado",
    "Submit assistant task" : "Enviar tarea al asistente",
    "Submit" : "Enviar",
    "Copy task output" : "Copiar la salida de la tarea",
    "Copy" : "Copia",
    "Try again" : "Vuelve a intentarlo",
    "Result could not be copied to clipboard" : "El resultado no pudo ser copiado al portapapeles",
    "Your task has been scheduled, you will receive a notification when it has finished" : "Su tarea ha sido agendada, recibirá una notificación una vez que termine",
    "Close" : "Cerrar",
    "Close Nextcloud Assistant" : "Cerrar el Asistente Nextcloud",
    "Assistant options saved" : "Opciones del Asistente guardadas",
    "Failed to save assistant options" : "Fallo al guardar las opciones del Asistente",
    "Failed to schedule your task" : "Fallo al agendar su tarea",
    "This task does not exist or has been cleaned up" : "Esta tarea no existe o no ha sido limpiada",
    "Failed to schedule the task" : "Fallo al agendar la tarea"
},"pluralForm" :"nplurals=3; plural=n == 1 ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}