{ "translations": {
    "Failed to notify when ready; unknown user" : "Échec de la notification lorsque prêt; utilisateur inconnu",
    "Failed to cancel notification; unknown user" : "Échec à l'annulation de la notification ; Utilisateur inconnu",
    "Send a message to a Talk conversation" : "Envoyer un message à une conversation Talk",
    "Create a conversation" : "Créer une conversation",
    "Send an email" : "Envoyer un e-mail",
    "Schedule a calendar event" : "Planifier un événement du calendrier",
    "Add a calendar task" : "Ajouter une tâche au calendrier",
    "Create a Deck card" : "Créer une carte Deck",
    "User not logged in" : "Utilisateur non connecté",
    "User not found" : "Utilisateur non trouvé",
    "Failed to create a chat session" : "Échec de créer d'une session de tchat",
    "Failed to update the chat session" : "Échec de la mise à jour de la session du tchat",
    "Failed to delete the chat session" : "Échec de suppression de la session de tchat",
    "Failed to get chat sessions" : "Échec de l'obtenir des sessions de chat",
    "Session not found" : "Session non trouvée",
    "Message content is empty" : "Le contenu du message est vide",
    "Failed to add a chat message" : "Échec d'ajouter d'un message de discussion",
    "Failed to get chat messages" : "Échec de reception des messages du tchat",
    "Failed to delete a chat message" : "Échec de suppression d'un message de tchat",
    "Failed to delete the last message" : "Échec de suppression du dernier message",
    "Failed to add a chat message into DB" : "Échec de l'ajouter d'un message de discussion dans la base de données",
    "Failed to generate a title for the chat session" : "Échec de génération d'un titre pour la session de chat",
    "Nextcloud Assistant" : "Assistant Nextcloud",
    "Assistant task" : "Assistant de tâche",
    "AI text generation" : "Génération de texte par IA",
    "AI image generation" : "Génération d'image par IA",
    "AI audio transcription" : "Transcription audio par IA",
    "AI context writer" : "Rédacteur de contexte d'IA",
    "Writing style: %1$s; Source material: %2$s" : "Style rédactionnel : %1$s ; Données initiales : %2$s",
    "Context Chat" : "Discussion en contexte",
    "Task for \"%1$s\" has finished" : "La tâche pour « %1$s » est terminée",
    "\"%1$s\" task for \"%2$s\" has finished" : "La tâche « %1$s » pour « %2$s » est terminée",
    "Input: %1$s" : "Entrée : %1$s",
    "Result: %1$s" : "Résultat : %1$s",
    "View results" : "Afficher les résultats",
    "Task for \"%1$s\" has failed" : "La tâche pour « %1$s » a échoué",
    "\"%1$s\" task for \"%2$s\" has failed" : "La tâche « %1$s » pour « %2$s » a échoué.",
    "View task" : "Voir la tâche",
    "Assistant audio transcription" : "Assistant de retranscription audio",
    "Assistant document generation" : "Assistant de génération de document",
    "Nextcloud Calendar" : "Calendrier NextCloud",
    "Nextcloud Tasks" : "Tâches NextCloud",
    "Nextcloud Contacts" : "Contacts NextCloud",
    "Nextcloud user profile" : "Profil utilisateur Nextcloud",
    "Nextcloud Deck" : "Nextcloud Deck",
    "OpenStreetMap" : "OpenStreetMap",
    "Nextcloud Files" : "Fichiers NextCloud",
    "Assistant image generation" : "Assistant de génération d'image",
    "Nextcloud Mail" : "Nextcloud Mail",
    "OpenProject" : "OpenProject",
    "Nextcloud Talk" : "Nextcloud Talk",
    "DuckDuckGo web search" : "Recherche Web DuckDuckGo",
    "Chat with AI" : "Discuter avec l'IA",
    "Chat with an AI model." : "Discuter avec un modèle d'IA.",
    "Generate text" : "Générer du texte",
    "Send a request to the Assistant, for example: write a first draft of a presentation, give me suggestions for a presentation, write a draft reply to my colleague." : "Envoyez une requête à l’Assistant, par exemple : écris un premier brouillon de présentation, donne-moi des suggestions pour une présentation, écris un brouillon de réponse à mon collègue.",
    "Artificial Intelligence" : "Intelligence artificielle",
    "Process and transform text" : "Traiter et transformer le texte",
    "This app brings a user interface to use the Nextcloud text processing feature.\n\nIt allows users to launch AI tasks, be notified when they finish and see the results.\nThe assistant also appears in others apps like Text to easily process parts of a document.\n\nMore details on the assistant OCS API and frontend integration possibilities in the\n[developer doc](https://github.com/nextcloud/assistant/raw/main/docs/developer)\n\n### How to use it\n\nA new right header menu entry appears. Once clicked, the assistant is displayed and you can select and task type and\nset the input you want to process.\n\nThe task might run immediately or be scheduled depending on the time estimation given by the AI provider.\nOnce a task is scheduled, it will run as a background job. When it is finished, you will receive a notification\nfrom which the results can be displayed.\n\nOther apps can integrate with the assistant. For example, Text will display an inline button besides every paragraph\nto directly select a task type to process this paragraph. Selecting a task this way will open the assistant with the task\nbeing pre-selected and the input text set.\n\nMore details and screenshots in the [user doc](https://github.com/nextcloud/assistant/raw/main/docs/user).\n\n## Features\n\nIn the assistant, the list of available tasks depends on the available providers installed via other apps.\nThis means you have complete freedom over which service/software will actually run your AI tasks.\n\n### Text processing providers\n\nSo far, the [Local Large language model](https://github.com/nextcloud/llm2#readme)\nand the [OpenAi/LocalAI integration](https://apps.nextcloud.com/apps/integration_openai) apps\ninclude text processing providers to:\n* Summarize\n* Extract topics\n* Generate a headline\n* Get an answer from a free prompt\n* Reformulate (OpenAi/LocalAi only)\n* Context writer: Generate text with a specified style. The style can be described or provided via an example text.\n\n### Text to image (Image generation)\n\nKnown providers:\n* [OpenAi/LocalAI integration](https://apps.nextcloud.com/apps/integration_openai)\n* [Text2Image Stable Diffusion](https://apps.nextcloud.com/apps/text2image_stablediffusion)\n\n### Speech to text (Audio transcription)\n\nKnown providers:\n* [OpenAi/LocalAI integration](https://apps.nextcloud.com/apps/integration_openai)\n* [Local Whisper Speech-To-Text](https://apps.nextcloud.com/apps/stt_whisper)\n\nMore details on how to set this up in the [admin docs](https://docs.nextcloud.com/server/latest/admin_manual/ai/index.html)" : "Cette application apporte une interface utilisateur pour utiliser la fonctionnalité de traitement de texte Nextcloud.\n\nIl permet aux utilisateurs de lancer des tâches d'IA, d'être avertis lorsqu'elles sont terminées et de voir les résultats.\nL'assistant apparaît également dans d'autres applications comme Text pour traiter facilement des parties d'un document.\n\nPlus de détails sur l'assistant OCS API et les possibilités d'intégration frontend dans le\n[document développeur](https://github.com/nextcloud/assistant/raw/main/docs/developer)\n\n### Comment l'utiliser\n\nUne nouvelle entrée de menu d’en-tête droit apparaît. Une fois cliqué, l'assistant s'affiche et vous pouvez sélectionner un type de tâche et\ndéfinissez l'entrée que vous souhaitez traiter.\n\nLa tâche peut s'exécuter immédiatement ou être planifiée en fonction de l'estimation de temps donnée par le fournisseur d'IA.\nUne fois qu'une tâche est planifiée, elle s'exécutera en arrière-plan. Une fois terminé, vous recevrez une notification\nà partir duquel les résultats peuvent être affichés.\n\nD'autres applications peuvent s'intégrer à l'assistant. Par exemple, Text affichera un bouton en ligne à côté de chaque paragraphe\npour sélectionner directement un type de tâche pour traiter ce paragraphe. Sélectionner une tâche de cette façon ouvrira l'assistant avec la tâche\nétant présélectionné et le texte de saisie défini.\n\nPlus de détails et de captures d'écran dans la [documentation utilisateur](https://github.com/nextcloud/assistant/raw/main/docs/user).\n\n## Fonctionnalités\n\nDans cet assistant, la liste des tâches disponibles dépend des fournisseurs disponibles installés via d'autres applications.\nCela signifie que vous avez une liberté totale sur le service/logiciel qui exécutera réellement vos tâches d'IA.\n\n### Fournisseurs de traitement de texte\n\nJusqu'à présent, le [Modèle de langage Local Large](https://github.com/nextcloud/llm2#readme)\net les applications [Intégration OpenAi/LocalAI](https://apps.nextcloud.com/apps/integration_openai)\ninclure des fournisseurs de traitement de texte pour:\n* Résumer\n* Extraire des sujets\n* Générer un titre\n* Obtenez une réponse à partir de prompt gratuit\n* Reformuler (OpenAi/LocalAi uniquement)\n* Écrivain de contexte: générez du texte avec un style spécifié. Le style peut être décrit ou fourni via un exemple de texte.\n\n### Texte en image (Génération d'images)\n\nFournisseurs connus:\n* [Intégration OpenAi/LocalAI](https://apps.nextcloud.com/apps/integration_openai)\n* [Text2Image par Stable Diffusion](https://apps.nextcloud.com/apps/text2image_stablediffusion)\n\n### Discours en texte (Transcription audio)\n\nFournisseurs connus:\n* [Intégration OpenAi/LocalAI](https://apps.nextcloud.com/apps/integration_openai)\n* [Speech-To-Text local Whisper](https://apps.nextcloud.com/apps/stt_whisper)\n\nPlus de détails sur la façon de configurer cela dans la [documentation administrateur](https://docs.nextcloud.com/server/latest/admin_manual/ai/index.html)",
    "Assistant admin options saved" : "Options d'administration de l'assistant sauvegardées",
    "Failed to save assistant admin options" : "Échec de l'enregistrement des options d'administration de l'assistant",
    "Find more details on how to set up Assistant and recommended backends in the Administration documentation." : "Retrouvez plus de détails sur la configuration de l'Assistant et des backends recommandés dans la documentation d'administration.",
    "Select which features you want to enable" : "Sélectionnez quelles fonctionnalités vous souhaitez activer",
    "Enable Nextcloud Assistant in header" : "Activer l'Assistant Nextcloud dans l'entête",
    "To be able to use this feature, please install at least one AI task processing provider." : "Pour pouvoir utiliser cette fonctionnalité, veuillez installer au moins un fournisseur de traitement de tâche d'IA",
    "Enable AI text generation in smart picker" : "Activer la génération de texte par IA dans le sélecteur intelligent",
    "To enable this feature, please install an AI task processing provider for the free prompt task type:" : "Pour activer cette fonctionnalité, veuillez installer un fournisseur de traitement de tâche d'IA de type saisie libre:",
    "Enable text-to-image in smart picker" : "Activer la génération d'image à partir du texte dans le sélecteur intelligent",
    "To enable this feature, please install a text-to-image provider:" : "Pour activer cette fonctionnalité, veuillez installer un fournisseur de conversion texte-image:",
    "Enable speech-to-text in smart picker" : "Activer la génération de texte à partir de l'audio dans le sélecteur intelligent",
    "To enable this feature, please install a speech-to-text provider:" : "Pour activer cette fonctionnalité, veuillez installer un fournisseur de Speech-To-Text:",
    "Chat User Instructions for Chat Completions" : "Instructions de l'utilisateur pour la génération de texte dans le chat",
    "It is passed on to the LLM for it to better understand the context." : "Elle est transmise au LLM pour que celui-ci puisse mieux comprendre le contexte.",
    "\"{user}\" is a placeholder for the user's display name." : "\"{user}\" est un espace réservé pour le nom d'affichage de l'utilisateur.",
    "Chat User Instructions for Title Generation" : "Instructions d'utilisateur du tchat pour la génération de titre",
    "It is passed on to the LLMs to let it know what to do" : "Il est transmis aux LLM pour lui indiquer la marche à suivre",
    "\"{user}\" is a placeholder for the user's display name here as well." : "\"{user}\" est également un espace réservé pour le nom d'affichage de l'utilisateur.",
    "Last N messages to consider for chat completions" : "N derniers messages à prendre en compte pour la fin du chat",
    "This includes the user instructions and the LLM's messages" : "Cela inclut les instructions d'utilisation et les messages du LLM",
    "Number of messages to consider for chat completions (excluding the user instructions, which is always considered)" : "Nombre de messages à considérer pour l'achèvement du tchat (hors instructions utilisateur, qui sont toujours prises en compte)",
    "The task ran successfully but the result is identical to the input." : "La tâche s'est exécutée avec succès mais le résultat est identique à l'entrée.",
    "This output was generated by AI. Make sure to double-check and adjust." : "Cette sortie a été générée par une IA. Veillez à revérifier et à ajuster.",
    "Hide advanced options" : "Masquer les options avancées",
    "Show advanced options" : "Afficher les options avancées",
    "Try again" : "Réessayez",
    "Send request" : "Envoyer la requête",
    "Launch this task again" : "Relancez cette tâche",
    "Launch a task" : "Lancer une tâche",
    "Failed to parse some files" : "Échec de l'analyse de quelques fichiers",
    "Generate a first draft for a blog post about privacy" : "Générer un premier brouillon pour un article de blog sur la confidentialité",
    "What is the venue for the team retreat this quarter?" : "Quel est le lieu pour la retraite d'équipe ce trimestre ?",
    "Type or paste the text to summarize" : "Tapez ou collez du texte pour le résumer",
    "Type or paste the text to generate a headline for" : "Tapez ou collez du texte pour générer un titre pour ...",
    "Type or paste the text to extract the topics from" : "Tapez ou collez le texte pour extraire les sujets",
    "landscape trees forest peaceful" : "paysage arbres forêt paisible",
    "a number" : "un numéro",
    "Shakespeare or an example of the style" : "Shakespeare ou un exemple du style",
    "A description of what you need or some original content" : "Une description de ce dont vous avez besoin ou du contenu original",
    "New task" : "Nouvelle tâche",
    "Close" : "Fermer",
    "Close Nextcloud Assistant" : "Fermer l'assistant Nextcloud",
    "Less" : "Moins",
    "More" : "Plus",
    "If you are not satisfied with the actions the Assistant wants to run, you can adjust your request by sending a new message instead of clicking the \"Cancel\" button." : "Si vous n'êtes pas satisfait par les actions que l'assistant souhaite exécuter, vous pouvez ajuster votre demande en envoyant un nouveau message au lieu de cliquer sur le bouton \"Annuler\".",
    "The Assistant wants to perform sensitive actions on your behalf." : "L'assistant souhaite exécuter des actions sensibles en votre nom.",
    "Cancel" : "Annuler",
    "Confirm those actions" : "Confirmer ces actions",
    "Are you sure you want to delete \"{sessionTitle}\"?" : "Êtes-vous certain de vouloir supprimer {sessionTitle} ?",
    "Error generating a response" : "Erreur lors de la génération d'une réponse",
    "Error getting the generated title for the conversation" : "Erreur lors de la génération d'un titre pour la conversation",
    "Error checking if the session is thinking" : "Error lors de la vérification si la session est en cours de réflexion",
    "Error updating title of conversation" : "Erreur lors de la mise à jour du titre de la conversation",
    "Untitled conversation" : "Conversation sans titre",
    "Error generating a title for the conversation" : "Erreur lors de la génération d'un titre pour la conversation",
    "Error deleting conversation" : "Erreur lors de la suppression de la conversation",
    "Error fetching conversations" : "Erreur lors de la récupération des conversations",
    "Error deleting message" : "Erreur lors de la suppression du message",
    "Error fetching messages" : "Erreur lors de la récupération des messages",
    "Error creating a new message" : "Erreur lors de la création d'un nouveau message",
    "Invalid response received for a new conversation request" : "Réponse invalide reçue pour une nouvelle demande de conversation",
    "Error creating a new conversation" : "Erreur lors de la création d'une nouvelle conversation",
    "Error regenerating a response" : "Erreur lors de la régénération d'une réponse",
    "New conversation" : "Nouvelle conversation",
    "Loading conversations…" : "Chargement des conversations…",
    "No conversations yet" : "Aucune conversation pour l'instant",
    "Delete" : "Supprimer",
    "Conversation title" : "Titre de la conversation",
    "Edit title" : "Modifier le titre",
    "Generate title" : "Générer un titre",
    "Creating a new conversation" : "Créer une nouvelle conversation",
    "Hello there! What can I help you with today?" : "Bonjour! En quoi puis-je vous aider aujourd’hui?",
    "Try sending a message to spark a conversation." : "Essayez d'envoyer un message pour déclencher une conversation.",
    "Load older messages" : "Charger les anciens messages",
    "Retry response generation" : "Réessayer de générer une réponse",
    "Conversation deletion" : "Suppression de la conversation",
    "Error loading messages" : "Erreur du chargement des messages",
    "Loading messages…" : "Chargement des messages…",
    "The text must be shorter than or equal to {maxLength} characters, currently {length}" : "Le texte doit être plus court ou égal à {maxLength} caractères, actuellement {length}",
    "Cancel editing" : "Annuler la modification",
    "Submit" : "Soumettre",
    "Type a message…" : "Tapez un message…",
    "Processing…" : "Traitement…",
    "You" : "Vous",
    "Message copied to clipboard" : "Message copié dans le presse-papier",
    "Information sources" : "Sources d'information",
    "Copy message" : "Copier le message",
    "Regenerate message" : "Régénérer le message",
    "Delete message" : "Supprimer le message",
    "Select Files/Folders" : "Sélectionner des fichiers/dossiers",
    "Select Providers" : "Sélectionnez Providers",
    "Choose Files/Folders" : "Choisir des fichiers/dossiers",
    "Choose" : "Choisir",
    "Clear Selection" : "Effacer la sélection",
    "Error fetching default provider key" : "Erreur lors de la récupération de la clé du fournisseur par défaut",
    "Error fetching providers" : "Erreur lors de la récupération des fournisseurs",
    "Context Chat has not finished indexing all your documents yet, it may not be able to answer your questions, yet." : "Context Chat n'a pas encore fini d'indexer tous vos documents, il se peut qu'il ne soit pas encore en mesure de répondre à vos questions.",
    "Selective context" : "Contexte sélectif",
    "No sources referenced" : "Aucune source référencée",
    "tool" : "outil",
    "integration" : "intégration",
    "complete AI documentation" : "documentation IA complète",
    "AI provider apps can be found in the {toolLink} and {integrationLink} app settings sections." : "Les applications des fournisseurs d'IA peuvent être trouvé dans les paramètres des applications {toolLink} et {integrationLink}.",
    "You can also check the {aiAdminDocLink}" : "Vous pouvez également consulter le {aiAdminDocLink}",
    "No provider found" : "Aucun fournisseur trouvé",
    "AI Providers need to be installed to use the Assistant" : "Des fournisseurs IA doivent être installés pour utiliser l’Assistant",
    "Assistant options saved" : "Options de l'assistant sauvegardées",
    "Failed to save assistant options" : "Échec de l'enregistrement des options de l'assistant",
    "Enable AI image generation in smart picker" : "Activer le générateur d'image par IA dans le sélecteur intelligent",
    "Enable AI transcription in smart picker" : "Activer la retranscription audio par IA dans le sélecteur intelligent",
    "No suitable providers are available. They must first be enabled by your administrator." : "Aucun fournisseur approprié n'est disponible. Ils doivent d'abord être activés par votre administrateur.",
    "Configured backends" : "Logiciels configurés",
    "The following services are used as backends for Nextcloud Assistant:" : "Les services suivants sont utilisés comme backends pour Nextcloud Assistant:",
    "This may take a few seconds…" : "Cela ne devrait durer que quelques secondes …",
    "This may take a few minutes…" : "Cela peut prendre quelques minutes...",
    "Getting results…" : "Récupération des résultats…",
    "Get notified when the task finishes" : "Être notifié quand la tâche est terminée",
    "Cancel task" : "Annuler la tâche",
    "You have not submitted any \"{taskTypeName}\" task yet" : "Vous n’avez soumis encore aucune tâche « {taskTypeName} »",
    "Nothing yet" : "Rien pour l’instant",
    "Succeeded" : "Succès",
    "Cancelled" : "Annulé",
    "Failed" : "Échec",
    "Running" : "Exécution",
    "Scheduled" : "Planifié",
    "_{n} image generated_::_{n} images generated_" : ["{n} image générée","{n} images générées","{n} image(s) générée(s)"],
    "_{n} image scheduled_::_{n} images scheduled_" : ["{n} image planifiée","{n} images planifiées","{n} images planifées"],
    "Task scheduled" : "Tâche planifiée",
    "Unknown status" : "État inconnu",
    "Error while recording audio" : "Erreur pendant l'enregistrement de l'audio",
    "Start recording" : "Lancer l’enregistrement",
    "Dismiss recording" : "Rejeter l'enregistrement",
    "End recording and send" : "Terminer l'enregistrement et l'envoyer",
    "Choose file" : "Choisir un fichier",
    "Choose a file" : "Choisir un fichier",
    "No file selected" : "Aucun fichier sélectionné",
    "Choose a value" : "Choisir une valeur",
    "Could not upload the recorded file" : "Impossible de téléverser le fichier enregistré",
    "Output file share link copied to clipboard" : "Lien de partage de fichier sortie est copié dans le presse-papiers",
    "Click this to open the file" : "Cliquez ici pour ouvrir le fichier",
    "Could not copy to clipboard" : "Impossible de copier dans le presse-papiers",
    "Upload from device" : "Téléverser depuis l’appareil",
    "Select from Nextcloud" : "Sélectionnez dans Nextcloud",
    "Pick one or multiple files" : "Sélectionner un ou plusieurs fichiers",
    "Remove this media" : "Supprimer ce média",
    "Download this media" : "Téléchargez ce média",
    "Save this media" : "Sauvegarder ce média",
    "Share this media" : "Partager ce média",
    "Pick a file" : "Choisir un fichier",
    "Clear value" : "Effacer la valeur",
    "Type some number" : "Tapez un numéro",
    "The current value is not a number" : "La valeur actuelle n'est pas un nombre",
    "Custom value" : "Valeur personnalisée",
    "Advanced" : "Avancé",
    "Choose a text file" : "Choisir un fichier texte",
    "Unexpected response from text parser" : "Réponse inattendue de l'analyseur de texte",
    "Could not parse file" : "Impossible d'analyser le fichier",
    "Result could not be copied to clipboard" : "Le résultat n'a pas pu être copié dans le presse-papiers",
    "Copy output" : "Copier la sortie",
    "Copy" : "Copier",
    "Upload file" : "Téléverser un fichier",
    "Could not upload the file" : "Impossible de téléverser le fichier",
    "Could not upload the files" : "Impossible de téléverser les fichiers",
    "Your task with ID {id} has failed" : "Votre tâche avec l'ID {id} a échoué",
    "Failed to schedule your task" : "Échec de la planification de votre tâche",
    "Submit the current task's result" : "Soumettre le résultat de la tâche en cours",
    "Output file for task {taskId} ({taskTypeName})" : "Fichier de sortie pour la tâche {taskId} ({taskTypeName})",
    "Assistant error" : "Erreur de l'assistant",
    "Please log in to view the task result" : "Veuillez vous connecter pour voir le résultat de la tâche",
    "This task does not exist or has been cleaned up" : "Cette tâche n'existe pas ou a été supprimée"
},"pluralForm" :"nplurals=3; plural=(n == 0 || n == 1) ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}