{ "translations": {
    "Nextcloud assistant" : "Assistente Nextcloud",
    "Task for \"%1$s\" has finished" : "A tarefa para \"%1$s\" foi concluída",
    "\"%1$s\" task for \"%2$s\" has finished" : "A tarefa \"%1$s\" para \"%2$s\" foi concluída",
    "Input: %1$s" : "Entrada: %1$s",
    "View results" : "Ver resultados",
    "Task for \"%1$s\" has failed" : "6 A tarefa para \"%1$s\" falhou",
    "\"%1$s\" task for \"%2$s\" has failed" : "A tarefa \"%1$s\" para \"%2$s\" falhou",
    "View task" : "Ver tarefa",
    "Artificial Intelligence" : "Inteligência artificial",
    "Process and transform text" : "Processar e transformar texto",
    "This app brings a user interface to use the Nextcloud text processing feature.\n\nIt allows users to launch text processing tasks, be notified when they finish and see the results.\nThe assistant also appears in others apps like Text to easily process parts of a document.\n\n### How to use it\n\nA new right header  menu entry appears. Once clicked, the assistant is displayed and you can select and task type and\nset the input text you want to process.\n\nOnce a task is scheduled, it will run as a background job. When it is finished, you will receive a notification\nfrom which the results can be displayed.\n\nOther apps can integrate with the assistant. For example, Text will display an inline button besides every paragraph\nto directly select a task type to process this paragraph. Selecting a task this way will open the assistant with the task\nbeing pre-selected and the input text set.\n\n### Text processing providers\n\nIn the assistant, the list of available tasks depends on the available providers installed via other apps.\nThis means you have complete freedom over which service/software will actually run your text processing tasks.\nSo far, the [Large language model](https://github.com/nextcloud/llm#readme)\nand the [OpenAi/LocalAI integration](https://apps.nextcloud.com/apps/integration_openai) apps\ninclude text processing providers to:\n* Summarize\n* Extract topics\n* Generate a headline\n* Get an answer from a free prompt\n* Reformulate (OpenAi/LocalAi only)" : "Este aplicativo traz uma interface de usuário para usar o recurso de processamento de texto Nextcloud.\n\nEle permite que os usuários iniciem tarefas de processamento de texto, sejam notificados quando terminarem e vejam os resultados.\nO assistente também aparece em outros aplicativos como o Text para processar facilmente partes de um documento.\n\n### Como usá-lo\n\nUma nova entrada de menu de cabeçalho à direita aparece. Uma vez clicado, o assistente é exibido e você pode selecionar um tipo de tarefa e\ndefina o texto de entrada que você deseja processar.\n\nDepois que uma tarefa é agendada, ela será executada como um trabalho em segundo plano. Quando terminar, você receberá uma notificação\na partir do qual os resultados podem ser exibidos.\n\nOutros aplicativos podem se integrar ao assistente. Por exemplo, Texto exibirá um botão embutido além de cada parágrafo\npara selecionar diretamente um tipo de tarefa para processar este parágrafo. Selecionar uma tarefa desta forma abrirá o assistente com a tarefa\nsendo pré-selecionado e o texto de entrada definido.\n\n### Provedores de processamento de texto\n\nNo assistente, a lista de tarefas disponíveis depende dos provedores disponíveis instalados por meio de outros aplicativos.\nIsso significa que você tem total liberdade sobre qual serviço/software realmente executará suas tarefas de processamento de texto.\nAté agora, o [modelo de linguagem grande](https://github.com/nextcloud/llm#readme)\ne os aplicativos [integração OpenAi/LocalAI](https://apps.nextcloud.com/apps/integration_openai)\nincluir provedores de processamento de texto para:\n* Resumir\n* Extrair tópicos\n* Gerar um título\n* Obtenha uma resposta de um prompt gratuito\n* Reformular (somente OpenAi/LocalAi)",
    "Select which features you want to enable" : "Selecione quais recursos você deseja ativar",
    "Top-right assistant" : "Assistente superior direito",
    "Assistant admin options saved" : "Opções de administração do assistente salvas",
    "Failed to save assistant admin options" : "Falha ao salvar as opções de administração do assistente",
    "Choose a task" : "Escolha uma tarefa",
    "Type some text" : "Digite algum texto",
    "Result" : "Resultado",
    "Submit assistant task" : "Enviar tarefa do assistente",
    "Submit" : "Enviar",
    "Copy task output" : "Copiar saída da tarefa",
    "Copy" : "Copiar",
    "Try again" : "Tente novamente",
    "Result could not be copied to clipboard" : "O resultado não pôde ser copiado para a área de transferência",
    "Your task has been scheduled, you will receive a notification when it has finished" : "Sua tarefa foi agendada, você receberá uma notificação quando terminar",
    "Close" : "Fechar",
    "Close Nextcloud assistant" : "Fechar o assistente Nextcloud",
    "Assistant options saved" : "Opções do assistente salvas",
    "Failed to save assistant options" : "Falha ao salvar as opções do assistente",
    "Failed to schedule your task" : "Falha ao agendar sua tarefa",
    "This task does not exist or has been cleaned up" : "Esta tarefa não existe ou foi limpa",
    "Failed to schedule the task" : "Falha ao agendar a tarefa"
},"pluralForm" :"nplurals=3; plural=(n == 0 || n == 1) ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}